---
kind: type
id: T:Autodesk.Revit.DB.Mechanical.MEPBuildingConstructionSetIterator
source: html/1c1d2aad-c8ff-1e00-5c78-bc4affed0cac.htm
---
# Autodesk.Revit.DB.Mechanical.MEPBuildingConstructionSetIterator

An iterator to a MEPBuildingConstruction set.

## Syntax (C#)
```csharp
public abstract class MEPBuildingConstructionSetIterator : APIObject,
	IEnumerator
```